app/views/order_frequencies/index.html.erb

SELECT  "frequency_units".* FROM "frequency_units" WHERE "frequency_units"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <% if order_frequency.present? %>
          <% @frq_unit = FrequencyUnit.find_by_id(order_frequency.unit) %>