app/views/patient_summary/show.html.erb

SELECT  "admissions".* FROM "admissions" WHERE "admissions"."patient_id" = $1 LIMIT $2  [["patient_id", 3], ["LIMIT", 1]]
SELECT "symptoms".* FROM "symptoms" WHERE "symptoms"."admission_id" = $1  [["admission_id", 1]]
---
          on <%= @patient.admission_id && @patient.admission_id %>
          due to <%= @dignosis && @dignosis.description %>.
          The observed symptoms on admission were <%= to_sentence Symptom.all.map(&:description) %>.
          <%= @patient.admission_id && @patient.admission_id %>.
        </p>

SELECT "diagnoses".* FROM "diagnoses" WHERE "diagnoses"."patient_id" = $1  [["patient_id", 1]]
---
        <p>
          The staff performed <%= @dignosis_procedure && @dignosis_procedure.description %>,
          revealing <%= to_sentence @patient.diagnoses && @patient.diagnoses.map(&:described_code) %>. Our team proceeded to