app/views/patients/_edit_form.html.erb

SELECT "allergies".* FROM "allergies" WHERE "allergies"."patient_id" = $1  [["patient_id", 1]]
SELECT  "allergies".* FROM "allergies" WHERE "allergies"."patient_id" = $1 ORDER BY "allergies"."id" ASC LIMIT $2  [["patient_id", 1], ["LIMIT", 1]]
---
      <option>Select Allergies</option>
      <% Allergy.all.each do |allergies| %>
        <option value="<%= allergies.id %>" <% if @patient.allergies_id.present? %> <% if @patient.allergies_id == allergies.id %> selected <% end %><% end %>><%= allergies.description %></option>

SELECT "diagnostic_procedures".* FROM "diagnostic_procedures"
---
      <option>Select Dygnostic Procedure</option>
      <% DiagnosticProcedure.all.each do |dygnosis| %>

SELECT "medication_orders".* FROM "medication_orders" WHERE "medication_orders"."patient_id" = $1  [["patient_id", 1]]
---
      <option>Select Medications</option>
      <% MedicationOrder.all.each do |med| %>

SELECT "treatments".* FROM "treatments"
SELECT  "treatments".* FROM "treatments" WHERE "treatments"."patient_id" = $1 ORDER BY "treatments"."id" ASC LIMIT $2  [["patient_id", 1], ["LIMIT", 1]]
---
      <option>Select Treatments</option>
      <% Treatment.all.each do |med| %>
        <option value="<%= med.id %>" <% if @patient.treatments_id.present? %> <% if @patient.treatments_id == med.id %> selected <% end %><% end %>><%= med.description %></option>

SELECT  "admissions".* FROM "admissions" WHERE "admissions"."patient_id" = $1 LIMIT $2  [["patient_id", 1], ["LIMIT", 1]]
---
    <label>Admission date and time</label>
    <input type="text" class="form-control jq-datepicker1" name="admission_id" value="<%= @patient.admission_id.present? ? @patient.admission_id : '' %>"></input>