app/controllers/allergies_controller.rb

SELECT "allergies".* FROM "allergies"
---
  def index
    @allergies = Allergy.all

INSERT INTO "allergies" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "New Allergy"], ["created_at", "2019-04-19 13:23:25.895796"], ["updated_at", "2019-04-19 13:23:25.895796"]]
---
  def create
    @allergy = Allergy.new(allergy_params)

    respond_to do |format|
      if @allergy.save

DELETE FROM "allergies" WHERE "allergies"."id" = $1  [["id", 2]]
---
  def destroy
    @allergy.destroy

SELECT  "allergies".* FROM "allergies" WHERE "allergies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_allergy
      @allergy = Allergy.find(params[:id])