app/controllers/diagnostic_procedures_controller.rb

  def index
    @diagnostic_procedures = DiagnosticProcedure.all
---
SELECT "diagnostic_procedures".* FROM "diagnostic_procedures"

  def create

    @diagnostic_procedure = DiagnosticProcedure.new(diagnostic_procedure_params)

    respond_to do |format|
      if @diagnostic_procedure.save
---
INSERT INTO "diagnostic_procedures" ("description", "moment", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "X-ray"], ["moment", "2019-04-22 08:42:05"], ["created_at", "2019-04-22 08:42:32.653636"], ["updated_at", "2019-04-22 08:42:32.653636"]]

  def update
    respond_to do |format|
      if @diagnostic_procedure.update(diagnostic_procedure_params)
---
UPDATE "diagnostic_procedures" SET "moment" = $1, "updated_at" = $2 WHERE "diagnostic_procedures"."id" = $3  [["moment", "2019-04-22 08:42:41"], ["updated_at", "2019-04-22 08:42:43.461322"], ["id", 5]]

  def destroy
    @diagnostic_procedure.destroy
---
DELETE FROM "diagnostic_procedures" WHERE "diagnostic_procedures"."id" = $1  [["id", 2]]

    def set_diagnostic_procedure
      @diagnostic_procedure = DiagnosticProcedure.find(params[:id])
---
SELECT  "diagnostic_procedures".* FROM "diagnostic_procedures" WHERE "diagnostic_procedures"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]