app/controllers/facilities_controller.rb

  def index
    @facilities = Facility.all
---
SELECT "facilities".* FROM "facilities"

  def create
    @facility = Facility.new(facility_params)

    respond_to do |format|
      if @facility.save
---
INSERT INTO "facilities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New Facility at sms"], ["created_at", "2019-04-22 09:16:35.497943"], ["updated_at", "2019-04-22 09:16:35.497943"]]

  def destroy
    @facility.destroy
---
DELETE FROM "facilities" WHERE "facilities"."id" = $1  [["id", 2]]

    def set_facility
      @facility = Facility.find(params[:id])
---
SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]