app/controllers/frequency_units_controller.rb

SELECT "frequency_units".* FROM "frequency_units"
---
  def index
    @frequency_units = FrequencyUnit.all

INSERT INTO "frequency_units" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Hour"], ["created_at", "2019-04-22 09:55:41.161557"], ["updated_at", "2019-04-22 09:55:41.161557"]]
---
  def create
    @frequency_unit = FrequencyUnit.new(frequency_unit_params)

    respond_to do |format|
      if @frequency_unit.save

SELECT  "frequency_units".* FROM "frequency_units" WHERE "frequency_units"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_frequency_unit
      @frequency_unit = FrequencyUnit.find(params[:id])