app/controllers/mass_units_controller.rb

  def index
    @mass_units = MassUnit.all
---
SELECT "mass_units".* FROM "mass_units"

  def create
    @mass_unit = MassUnit.new(mass_unit_params)

    respond_to do |format|
      if @mass_unit.save
---
INSERT INTO "mass_units" ("unit", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["unit", "mg"], ["created_at", "2019-04-22 06:57:25.786645"], ["updated_at", "2019-04-22 06:57:25.786645"]]

  def destroy
    @mass_unit.destroy
---
DELETE FROM "mass_units" WHERE "mass_units"."id" = $1  [["id", 2]]

    def set_mass_unit
      @mass_unit = MassUnit.find(params[:id])
---
SELECT  "mass_units".* FROM "mass_units" WHERE "mass_units"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]