app/controllers/medication_routes_controller.rb

SELECT "medication_routes".* FROM "medication_routes"
---
  def index
    @medication_routes = MedicationRoute.all

INSERT INTO "medication_routes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "15 days"], ["created_at", "2019-04-22 09:57:21.076310"], ["updated_at", "2019-04-22 09:57:21.076310"]]
---
  def create
    @medication_route = MedicationRoute.new(medication_route_params)

    respond_to do |format|
      if @medication_route.save

SELECT  "medication_routes".* FROM "medication_routes" WHERE "medication_routes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_medication_route
      @medication_route = MedicationRoute.find(params[:id])