app/controllers/medication_orders_controller.rb

SELECT "medication_orders".* FROM "medication_orders"
---
  def index
    @medication_orders = MedicationOrder.all

SELECT "mass_units".* FROM "mass_units"
SELECT "medication_routes".* FROM "medication_routes"
---
  def new
    @medication_order = MedicationOrder.new
    @mass_unit = MassUnit.all
    @medication_route = MedicationRoute.all

SELECT "medication_routes".* FROM "medication_routes"
SELECT "mass_units".* FROM "mass_units"
---
  def edit
    @medication_route = MedicationRoute.all
    @mass_unit = MassUnit.all

INSERT INTO "medication_orders" ("name", "unit", "dosage", "route", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Crocin"], ["unit", "1.0"], ["dosage", "100.0"], ["route", 1], ["created_at", "2019-04-22 11:25:14.212603"], ["updated_at", "2019-04-22 11:25:14.212603"]]
---
  def create
    @medication_order = MedicationOrder.new(medication_order_params)

    respond_to do |format|
      if @medication_order.save

SELECT  "medication_orders".* FROM "medication_orders" WHERE "medication_orders"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_medication_order
      @medication_order = MedicationOrder.find(params[:id])