app/controllers/observations_controller.rb

SELECT "observations".* FROM "observations"
---
  def index
    @observations = Observation.all

INSERT INTO "observations" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "ghdfh"], ["created_at", "2019-04-22 09:39:15.191573"], ["updated_at", "2019-04-22 09:39:15.191573"]]
---
  def create
    @observation = Observation.new(observation_params)

    respond_to do |format|
      if @observation.save

DELETE FROM "observations" WHERE "observations"."id" = $1  [["id", 2]]
---
  def destroy
    @observation.destroy

SELECT  "observations".* FROM "observations" WHERE "observations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_observation
      @observation = Observation.find(params[:id])