app/controllers/order_frequencies_controller.rb

  def index
    @order_frequencies = OrderFrequency.all
---
SELECT  "order_frequencies".* FROM "order_frequencies" ORDER BY "order_frequencies"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def new
    @order_frequency = OrderFrequency.new
    @frequency_unit = FrequencyUnit.all
---
SELECT "frequency_units".* FROM "frequency_units"

  def edit
    @frequency_unit = FrequencyUnit.all
---
SELECT "frequency_units".* FROM "frequency_units"

  def create
    @order_frequency = OrderFrequency.new(order_frequency_params)

    respond_to do |format|
      if @order_frequency.save
---
INSERT INTO "order_frequencies" ("value", "unit", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", "hfgh"], ["unit", 1], ["created_at", "2019-04-22 10:24:02.239840"], ["updated_at", "2019-04-22 10:24:02.239840"]]

  def update
    respond_to do |format|
      if @order_frequency.update(order_frequency_params)
---
UPDATE "order_frequencies" SET "unit" = $1, "updated_at" = $2 WHERE "order_frequencies"."id" = $3  [["unit", nil], ["updated_at", "2019-04-22 10:24:08.538434"], ["id", 3]]

  def destroy
    @order_frequency.destroy
---
DELETE FROM "order_frequencies" WHERE "order_frequencies"."id" = $1  [["id", 1]]

    def set_order_frequency
      @order_frequency = OrderFrequency.find(params[:id])
---
SELECT  "order_frequencies".* FROM "order_frequencies" WHERE "order_frequencies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]