app/controllers/patient_summary_controller.rb

  def show
    @patient = Patient.find(params[:id])
    @facility = Facility.first


    @dignosis = Diagnosis.find_by_id(@patient.dygnosis_id)
    @allergies = Allergy.find_by_id(@patient.allergies_id)
    @dignosis_procedure = DiagnosticProcedure.find_by_id(@patient.dygnosis_procedure_id)
    @medications = MedicationOrder.find_by_id(@patient.medications_id)
    @treatments = Treatment.find_by_id(@patient.treatments_id)
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "facilities".* FROM "facilities" ORDER BY "facilities"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "allergies".* FROM "allergies" WHERE "allergies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "diagnostic_procedures".* FROM "diagnostic_procedures" WHERE "diagnostic_procedures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "medication_orders".* FROM "medication_orders" WHERE "medication_orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "treatments".* FROM "treatments" WHERE "treatments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]