app/controllers/patients_controller.rb

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    add_breadcrumb '<< Patients', patients_path

    @patient = Patient.find(params[:id])

INSERT INTO "patients" ("first_name", "middle_name", "last_name", "mr", "dob", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "patients" SET "allergies_id" = 1, "dygnosis_id" = 2, "dygnosis_procedure_id" = 1, "medications_id" = 1, "treatments_id" = 1, "admission_id" = '12-4-12' WHERE "patients"."id" = $1  [["id", 3]]
---
  def create
    add_breadcrumb '<< Patients', patients_path

    @patient = Patient.new(user_params)

    if @patient.save
      Patient.where(id: @patient.id).update_all(allergies_id: params[:allergies_id],dygnosis_id: params[:dygnosis_id],dygnosis_procedure_id: params[:dygnosis_procedure_id],medications_id: params[:medications_id],treatments_id: params[:treatments_id],admission_id: params[:admission_id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "patients" SET "allergies_id" = 1, "dygnosis_id" = 2, "dygnosis_procedure_id" = 1, "medications_id" = 1, "treatments_id" = 1, "admission_id" = '12-4-12' WHERE "patients"."id" = $1  [["id", 3]]
UPDATE "patients" SET "middle_name" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["middle_name", "Kumar"], ["updated_at", "2019-04-22 11:18:12.370795"], ["id", 1]]
---
  def update
    add_breadcrumb '<< Patients', patients_path

    @patient = Patient.find(params[:id])


    Patient.where(id: params[:id]).update_all(allergies_id: params[:allergies_id],dygnosis_id: params[:dygnosis_id],dygnosis_procedure_id: params[:dygnosis_procedure_id],medications_id: params[:medications_id],treatments_id: params[:treatments_id],admission_id: params[:admission_id])
    if @patient.update_attributes(user_params)