app/controllers/symptoms_controller.rb

  def index
    @symptoms = Symptom.all
---
SELECT "symptoms".* FROM "symptoms"

  def create
    @symptom = Symptom.new(symptom_params)

    respond_to do |format|
      if @symptom.save
---
INSERT INTO "symptoms" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Pain in side tibia"], ["created_at", "2019-04-22 09:32:23.803805"], ["updated_at", "2019-04-22 09:32:23.803805"]]

  def destroy
    @symptom.destroy
---
DELETE FROM "symptoms" WHERE "symptoms"."id" = $1  [["id", 4]]

    def set_symptom
      @symptom = Symptom.find(params[:id])
---
SELECT  "symptoms".* FROM "symptoms" WHERE "symptoms"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]