app/controllers/treatments_controller.rb

SELECT "treatments".* FROM "treatments"
---
  def index
    @treatments = Treatment.all

INSERT INTO "treatments" ("description", "necessity", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Plaster on right leg"], ["necessity", "To prevent Muscle stiffness"], ["created_at", "2019-04-22 06:25:38.814686"], ["updated_at", "2019-04-22 06:25:38.814686"]]
---
  def create
    @treatment = Treatment.new(treatment_params)

    respond_to do |format|
      if @treatment.save

UPDATE "treatments" SET "necessity" = $1, "updated_at" = $2 WHERE "treatments"."id" = $3  [["necessity", "To prevent Muscle stiffness2"], ["updated_at", "2019-04-22 11:15:19.758189"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @treatment.update(treatment_params)

SELECT  "treatments".* FROM "treatments" WHERE "treatments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_treatment
      @treatment = Treatment.find(params[:id])