app/views/medication_orders/_form.html.erb

SELECT "mass_units".* FROM "mass_units"
---
      <% @mass_unit.each do |mass_unit| %>
        <option value="<%= mass_unit.id %>" <% if @medication_order.present? %><% if @medication_order.unit == mass_unit.id %> selected<% end %> <% end %> ><%= mass_unit.unit %></option>