app/views/medication_orders/index.html.erb

        %>
        <% @massunit = MassUnit.find_by_id(med_or) %>
---
SELECT  "mass_units".* FROM "mass_units" WHERE "mass_units"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        <td><%= medication_order.dosage %></td>
        <% @medroute = MedicationRoute.find_by_id(medication_order.route) %>
---
SELECT  "medication_routes".* FROM "medication_routes" WHERE "medication_routes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]